fa-xbrl/src/Enums/velpo_RatingAgencies/velpo_RatingAgencies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_RatingAgencies</name>
  <enumValues>
    <name>StandardAndPoors</name>
  </enumValues>
  <enumValues>
    <name>MoodysInvestorsService</name>
  </enumValues>
  <enumValues>
    <name>FitchRatings</name>
  </enumValues>
  <enumValues>
    <name>ExpertRA</name>
  </enumValues>
  <enumValues>
    <name>ACRA</name>
  </enumValues>
  <enumValues>
    <name>AM_Best</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/Enums/velpo_RatingAgencies/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// FA-XBRL, Bookkeeping and XBRL proccessor
//
// @author: Paul Tarasov
//	@email: paul.tarasov@velpo.ru
// 
// Copyright (c) 2021 Paul Tarasov (Velpo)
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
	
Function GetStructure() Export

	// import
	RatingAgencies = Enums.velpo_RatingAgencies;
	
	RaitingStructure = New Structure;
	RaitingStructure.Insert("StandardAndPoors", RatingAgencies.StandardAndPoors);
	RaitingStructure.Insert("MoodysInvestorsService", RatingAgencies.MoodysInvestorsService);
	RaitingStructure.Insert("FitchRatings", RatingAgencies.FitchRatings);
	RaitingStructure.Insert("ExpertRA", RatingAgencies.ExpertRA);
	RaitingStructure.Insert("ACRA", RatingAgencies.ACRA);
	RaitingStructure.Insert("AM_Best", RatingAgencies.AM_Best);

	Return RaitingStructure;

EndFunction // GetStructure()

	
#EndIf
